dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
/*
 *  Generic include file for XC16 / XC16-DSC
 *
 *  Copyright 2023- Microchip Technology
 */

/*-------------------------------------------------------------------------
 * (c) Copyright 1999- Microchip Technology, All rights reserved
 *
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are
 * met:
 *
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above
 *         copyright notice, this list of conditions and the following
 *         disclaimer in the documentation and/or other materials provided
 *         with the distribution. Publication is not required when
 *         this file is used in an embedded application.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written
 *         permission.
 *
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */


#ifndef _XC_H
#define _XC_H

#if __XC16_VERSION__ >= 1059
#include <builtins.h>
#endif

/* ---------------------------------------------------------- */
/* Some useful macros for inline assembler instructions       */
/* ---------------------------------------------------------- */

#define Nop()    __builtin_nop()
#define ClrWdt() __builtin_clrwdt()
#define Sleep()  __builtin_pwrsav(0)
#define Idle()   __builtin_pwrsav(1)

#if defined(__PIC24EP128GP202__)
#include <p24EP128GP202.h>
#endif

#if defined(__PIC24EP128GP204__)
#include <p24EP128GP204.h>
#endif

#if defined(__PIC24EP128GP206__)
#include <p24EP128GP206.h>
#endif

#if defined(__PIC24EP128MC202__)
#include <p24EP128MC202.h>
#endif

#if defined(__PIC24EP128MC204__)
#include <p24EP128MC204.h>
#endif

#if defined(__PIC24EP128MC206__)
#include <p24EP128MC206.h>
#endif

#if defined(__PIC24EP256GP202__)
#include <p24EP256GP202.h>
#endif

#if defined(__PIC24EP256GP204__)
#include <p24EP256GP204.h>
#endif

#if defined(__PIC24EP256GP206__)
#include <p24EP256GP206.h>
#endif

#if defined(__PIC24EP256GU810__)
#include <p24EP256GU810.h>
#endif

#if defined(__PIC24EP256GU814__)
#include <p24EP256GU814.h>
#endif

#if defined(__PIC24EP256MC202__)
#include <p24EP256MC202.h>
#endif

#if defined(__PIC24EP256MC204__)
#include <p24EP256MC204.h>
#endif

#if defined(__PIC24EP256MC206__)
#include <p24EP256MC206.h>
#endif

#if defined(__PIC24EP32GP202__)
#include <p24EP32GP202.h>
#endif

#if defined(__PIC24EP32GP203__)
#include <p24EP32GP203.h>
#endif

#if defined(__PIC24EP32GP204__)
#include <p24EP32GP204.h>
#endif

#if defined(__PIC24EP32MC202__)
#include <p24EP32MC202.h>
#endif

#if defined(__PIC24EP32MC203__)
#include <p24EP32MC203.h>
#endif

#if defined(__PIC24EP32MC204__)
#include <p24EP32MC204.h>
#endif

#if defined(__PIC24EP512GP202__)
#include <p24EP512GP202.h>
#endif

#if defined(__PIC24EP512GP204__)
#include <p24EP512GP204.h>
#endif

#if defined(__PIC24EP512GP206__)
#include <p24EP512GP206.h>
#endif

#if defined(__PIC24EP512GP806__)
#include <p24EP512GP806.h>
#endif

#if defined(__PIC24EP512GU810__)
#include <p24EP512GU810.h>
#endif

#if defined(__PIC24EP512GU814__)
#include <p24EP512GU814.h>
#endif

#if defined(__PIC24EP512MC202__)
#include <p24EP512MC202.h>
#endif

#if defined(__PIC24EP512MC204__)
#include <p24EP512MC204.h>
#endif

#if defined(__PIC24EP512MC206__)
#include <p24EP512MC206.h>
#endif

#if defined(__PIC24EP64GP202__)
#include <p24EP64GP202.h>
#endif

#if defined(__PIC24EP64GP203__)
#include <p24EP64GP203.h>
#endif

#if defined(__PIC24EP64GP204__)
#include <p24EP64GP204.h>
#endif

#if defined(__PIC24EP64GP206__)
#include <p24EP64GP206.h>
#endif

#if defined(__PIC24EP64MC202__)
#include <p24EP64MC202.h>
#endif

#if defined(__PIC24EP64MC203__)
#include <p24EP64MC203.h>
#endif

#if defined(__PIC24EP64MC204__)
#include <p24EP64MC204.h>
#endif

#if defined(__PIC24EP64MC206__)
#include <p24EP64MC206.h>
#endif

#if defined(__PIC24F04KA200__)
#include <p24F04KA200.h>
#endif

#if defined(__PIC24F04KA201__)
#include <p24F04KA201.h>
#endif

#if defined(__PIC24F04KL100__)
#include <p24F04KL100.h>
#endif

#if defined(__PIC24F04KL101__)
#include <p24F04KL101.h>
#endif

#if defined(__PIC24F08KA101__)
#include <p24F08KA101.h>
#endif

#if defined(__PIC24F08KA102__)
#include <p24F08KA102.h>
#endif

#if defined(__PIC24F08KL200__)
#include <p24F08KL200.h>
#endif

#if defined(__PIC24F08KL201__)
#include <p24F08KL201.h>
#endif

#if defined(__PIC24F08KL301__)
#include <p24F08KL301.h>
#endif

#if defined(__PIC24F08KL302__)
#include <p24F08KL302.h>
#endif

#if defined(__PIC24F08KL401__)
#include <p24F08KL401.h>
#endif

#if defined(__PIC24F08KL402__)
#include <p24F08KL402.h>
#endif

#if defined(__PIC24F08KM101__)
#include <p24F08KM101.h>
#endif

#if defined(__PIC24F08KM102__)
#include <p24F08KM102.h>
#endif

#if defined(__PIC24F08KM202__)
#include <p24F08KM202.h>
#endif

#if defined(__PIC24F08KM204__)
#include <p24F08KM204.h>
#endif

#if defined(__PIC24F16KA101__)
#include <p24F16KA101.h>
#endif

#if defined(__PIC24F16KA102__)
#include <p24F16KA102.h>
#endif

#if defined(__PIC24F16KA301__)
#include <p24F16KA301.h>
#endif

#if defined(__PIC24F16KA302__)
#include <p24F16KA302.h>
#endif

#if defined(__PIC24F16KA304__)
#include <p24F16KA304.h>
#endif

#if defined(__PIC24F16KL401__)
#include <p24F16KL401.h>
#endif

#if defined(__PIC24F16KL402__)
#include <p24F16KL402.h>
#endif

#if defined(__PIC24F16KM102__)
#include <p24F16KM102.h>
#endif

#if defined(__PIC24F16KM104__)
#include <p24F16KM104.h>
#endif

