dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
#if defined(__PIC24F16KM202__)
#include <p24F16KM202.h>
#endif

#if defined(__PIC24F16KM204__)
#include <p24F16KM204.h>
#endif

#if defined(__PIC24F32KA301__)
#include <p24F32KA301.h>
#endif

#if defined(__PIC24F32KA302__)
#include <p24F32KA302.h>
#endif

#if defined(__PIC24F32KA304__)
#include <p24F32KA304.h>
#endif

#if defined(__PIC24FJ1024GA606__)
#include <p24FJ1024GA606.h>
#endif

#if defined(__PIC24FJ1024GA610__)
#include <p24FJ1024GA610.h>
#endif

#if defined(__PIC24FJ1024GB606__)
#include <p24FJ1024GB606.h>
#endif

#if defined(__PIC24FJ1024GB610__)
#include <p24FJ1024GB610.h>
#endif

#if defined(__PIC24FJ128DA106__)
#include <p24FJ128DA106.h>
#endif

#if defined(__PIC24FJ128DA110__)
#include <p24FJ128DA110.h>
#endif

#if defined(__PIC24FJ128DA206__)
#include <p24FJ128DA206.h>
#endif

#if defined(__PIC24FJ128DA210__)
#include <p24FJ128DA210.h>
#endif

#if defined(__PIC24FJ128GA006__)
#include <p24FJ128GA006.h>
#endif

#if defined(__PIC24FJ128GA008__)
#include <p24FJ128GA008.h>
#endif

#if defined(__PIC24FJ128GA010__)
#include <p24FJ128GA010.h>
#endif

#if defined(__PIC24FJ128GA106__)
#include <p24FJ128GA106.h>
#endif

#if defined(__PIC24FJ128GA108__)
#include <p24FJ128GA108.h>
#endif

#if defined(__PIC24FJ128GA110__)
#include <p24FJ128GA110.h>
#endif

#if defined(__PIC24FJ128GA202__)
#include <p24FJ128GA202.h>
#endif

#if defined(__PIC24FJ128GA204__)
#include <p24FJ128GA204.h>
#endif

#if defined(__PIC24FJ128GA306__)
#include <p24FJ128GA306.h>
#endif

#if defined(__PIC24FJ128GA308__)
#include <p24FJ128GA308.h>
#endif

#if defined(__PIC24FJ128GA310__)
#include <p24FJ128GA310.h>
#endif

#if defined(__PIC24FJ128GA406__)
#include <p24FJ128GA406.h>
#endif

#if defined(__PIC24FJ128GA410__)
#include <p24FJ128GA410.h>
#endif

#if defined(__PIC24FJ128GA412__)
#include <p24FJ128GA412.h>
#endif

#if defined(__PIC24FJ128GA606__)
#include <p24FJ128GA606.h>
#endif

#if defined(__PIC24FJ128GA610__)
#include <p24FJ128GA610.h>
#endif

#if defined(__PIC24FJ128GA702__)
#include <p24FJ128GA702.h>
#endif

#if defined(__PIC24FJ128GA704__)
#include <p24FJ128GA704.h>
#endif

#if defined(__PIC24FJ128GA705__)
#include <p24FJ128GA705.h>
#endif

#if defined(__PIC24FJ128GB106__)
#include <p24FJ128GB106.h>
#endif

#if defined(__PIC24FJ128GB108__)
#include <p24FJ128GB108.h>
#endif

#if defined(__PIC24FJ128GB110__)
#include <p24FJ128GB110.h>
#endif

#if defined(__PIC24FJ128GB202__)
#include <p24FJ128GB202.h>
#endif

#if defined(__PIC24FJ128GB204__)
#include <p24FJ128GB204.h>
#endif

#if defined(__PIC24FJ128GB206__)
#include <p24FJ128GB206.h>
#endif

#if defined(__PIC24FJ128GB210__)
#include <p24FJ128GB210.h>
#endif

#if defined(__PIC24FJ128GB406__)
#include <p24FJ128GB406.h>
#endif

#if defined(__PIC24FJ128GB410__)
#include <p24FJ128GB410.h>
#endif

#if defined(__PIC24FJ128GB412__)
#include <p24FJ128GB412.h>
#endif

#if defined(__PIC24FJ128GB606__)
#include <p24FJ128GB606.h>
#endif

#if defined(__PIC24FJ128GB610__)
#include <p24FJ128GB610.h>
#endif

#if defined(__PIC24FJ128GC006__)
#include <p24FJ128GC006.h>
#endif

#if defined(__PIC24FJ128GC010__)
#include <p24FJ128GC010.h>
#endif

#if defined(__PIC24FJ128GL302__)
#include <p24FJ128GL302.h>
#endif

#if defined(__PIC24FJ128GL303__)
#include <p24FJ128GL303.h>
#endif

#if defined(__PIC24FJ128GL305__)
#include <p24FJ128GL305.h>
#endif

#if defined(__PIC24FJ128GL306__)
#include <p24FJ128GL306.h>
#endif

#if defined(__PIC24FJ128GL405__)
#include <p24FJ128GL405.h>
#endif

#if defined(__PIC24FJ128GL406__)
#include <p24FJ128GL406.h>
#endif

#if defined(__PIC24FJ128GL408__)
#include <p24FJ128GL408.h>
#endif

#if defined(__PIC24FJ128GL410__)
#include <p24FJ128GL410.h>
#endif

#if defined(__PIC24FJ128GU405__)
#include <p24FJ128GU405.h>
#endif

#if defined(__PIC24FJ128GU406__)
#include <p24FJ128GU406.h>
#endif

#if defined(__PIC24FJ128GU408__)
#include <p24FJ128GU408.h>
#endif

#if defined(__PIC24FJ128GU410__)
#include <p24FJ128GU410.h>
#endif

#if defined(__PIC24FJ16GA002__)
#include <p24FJ16GA002.h>
#endif

#if defined(__PIC24FJ16GA004__)
#include <p24FJ16GA004.h>
#endif

#if defined(__PIC24FJ16MC101__)
#include <p24FJ16MC101.h>
#endif

#if defined(__PIC24FJ16MC102__)
#include <p24FJ16MC102.h>
#endif

#if defined(__PIC24FJ192GA106__)
#include <p24FJ192GA106.h>
#endif

#if defined(__PIC24FJ192GA108__)
#include <p24FJ192GA108.h>
#endif

#if defined(__PIC24FJ192GA110__)
#include <p24FJ192GA110.h>
#endif

#if defined(__PIC24FJ192GB106__)
#include <p24FJ192GB106.h>
#endif

#if defined(__PIC24FJ192GB108__)
#include <p24FJ192GB108.h>
#endif

#if defined(__PIC24FJ192GB110__)
#include <p24FJ192GB110.h>
#endif

#if defined(__PIC24FJ256DA106__)
#include <p24FJ256DA106.h>
#endif

#if defined(__PIC24FJ256DA110__)
#include <p24FJ256DA110.h>
#endif

#if defined(__PIC24FJ256DA206__)
#include <p24FJ256DA206.h>
#endif

#if defined(__PIC24FJ256DA210__)
#include <p24FJ256DA210.h>
#endif

#if defined(__PIC24FJ256GA106__)
#include <p24FJ256GA106.h>
#endif

#if defined(__PIC24FJ256GA108__)
#include <p24FJ256GA108.h>
#endif

#if defined(__PIC24FJ256GA110__)
#include <p24FJ256GA110.h>
#endif

#if defined(__PIC24FJ256GA406__)
#include <p24FJ256GA406.h>
#endif

#if defined(__PIC24FJ256GA410__)
#include <p24FJ256GA410.h>
#endif

#if defined(__PIC24FJ256GA412__)
#include <p24FJ256GA412.h>
#endif

#if defined(__PIC24FJ256GA606__)
#include <p24FJ256GA606.h>
#endif

#if defined(__PIC24FJ256GA610__)
#include <p24FJ256GA610.h>
#endif

#if defined(__PIC24FJ256GA702__)
#include <p24FJ256GA702.h>
#endif

#if defined(__PIC24FJ256GA704__)
#include <p24FJ256GA704.h>
#endif

#if defined(__PIC24FJ256GA705__)
#include <p24FJ256GA705.h>
#endif

#if defined(__PIC24FJ256GB106__)
#include <p24FJ256GB106.h>
#endif

#if defined(__PIC24FJ256GB108__)
#include <p24FJ256GB108.h>
#endif

#if defined(__PIC24FJ256GB110__)
#include <p24FJ256GB110.h>
#endif

#if defined(__PIC24FJ256GB206__)
#include <p24FJ256GB206.h>
#endif

#if defined(__PIC24FJ256GB210__)
#include <p24FJ256GB210.h>
#endif

#if defined(__PIC24FJ256GB406__)
#include <p24FJ256GB406.h>
#endif

