dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
#if defined(__PIC24FJ256GB410__)
#include <p24FJ256GB410.h>
#endif

#if defined(__PIC24FJ256GB412__)
#include <p24FJ256GB412.h>
#endif

#if defined(__PIC24FJ256GB606__)
#include <p24FJ256GB606.h>
#endif

#if defined(__PIC24FJ256GB610__)
#include <p24FJ256GB610.h>
#endif

#if defined(__PIC24FJ256GL405__)
#include <p24FJ256GL405.h>
#endif

#if defined(__PIC24FJ256GL406__)
#include <p24FJ256GL406.h>
#endif

#if defined(__PIC24FJ256GL408__)
#include <p24FJ256GL408.h>
#endif

#if defined(__PIC24FJ256GL410__)
#include <p24FJ256GL410.h>
#endif

#if defined(__PIC24FJ256GU405__)
#include <p24FJ256GU405.h>
#endif

#if defined(__PIC24FJ256GU406__)
#include <p24FJ256GU406.h>
#endif

#if defined(__PIC24FJ256GU408__)
#include <p24FJ256GU408.h>
#endif

#if defined(__PIC24FJ256GU410__)
#include <p24FJ256GU410.h>
#endif

#if defined(__PIC24FJ32GA002__)
#include <p24FJ32GA002.h>
#endif

#if defined(__PIC24FJ32GA004__)
#include <p24FJ32GA004.h>
#endif

#if defined(__PIC24FJ32GA102__)
#include <p24FJ32GA102.h>
#endif

#if defined(__PIC24FJ32GA104__)
#include <p24FJ32GA104.h>
#endif

#if defined(__PIC24FJ32GB002__)
#include <p24FJ32GB002.h>
#endif

#if defined(__PIC24FJ32GB004__)
#include <p24FJ32GB004.h>
#endif

#if defined(__PIC24FJ32GP202__)
#include <p24FJ32GP202.h>
#endif

#if defined(__PIC24FJ32GP203__)
#include <p24FJ32GP203.h>
#endif

#if defined(__PIC24FJ32GP205__)
#include <p24FJ32GP205.h>
#endif

#if defined(__PIC24FJ32GU202__)
#include <p24FJ32GU202.h>
#endif

#if defined(__PIC24FJ32GU203__)
#include <p24FJ32GU203.h>
#endif

#if defined(__PIC24FJ32GU205__)
#include <p24FJ32GU205.h>
#endif

#if defined(__PIC24FJ32MC101__)
#include <p24FJ32MC101.h>
#endif

#if defined(__PIC24FJ32MC102__)
#include <p24FJ32MC102.h>
#endif

#if defined(__PIC24FJ32MC104__)
#include <p24FJ32MC104.h>
#endif

#if defined(__PIC24FJ48GA002__)
#include <p24FJ48GA002.h>
#endif

#if defined(__PIC24FJ48GA004__)
#include <p24FJ48GA004.h>
#endif

#if defined(__PIC24FJ512GA606__)
#include <p24FJ512GA606.h>
#endif

#if defined(__PIC24FJ512GA610__)
#include <p24FJ512GA610.h>
#endif

#if defined(__PIC24FJ512GB606__)
#include <p24FJ512GB606.h>
#endif

#if defined(__PIC24FJ512GB610__)
#include <p24FJ512GB610.h>
#endif

#if defined(__PIC24FJ512GL405__)
#include <p24FJ512GL405.h>
#endif

#if defined(__PIC24FJ512GL406__)
#include <p24FJ512GL406.h>
#endif

#if defined(__PIC24FJ512GL408__)
#include <p24FJ512GL408.h>
#endif

#if defined(__PIC24FJ512GL410__)
#include <p24FJ512GL410.h>
#endif

#if defined(__PIC24FJ512GU405__)
#include <p24FJ512GU405.h>
#endif

#if defined(__PIC24FJ512GU406__)
#include <p24FJ512GU406.h>
#endif

#if defined(__PIC24FJ512GU408__)
#include <p24FJ512GU408.h>
#endif

#if defined(__PIC24FJ512GU410__)
#include <p24FJ512GU410.h>
#endif

#if defined(__PIC24FJ64GA002__)
#include <p24FJ64GA002.h>
#endif

#if defined(__PIC24FJ64GA004__)
#include <p24FJ64GA004.h>
#endif

#if defined(__PIC24FJ64GA006__)
#include <p24FJ64GA006.h>
#endif

#if defined(__PIC24FJ64GA008__)
#include <p24FJ64GA008.h>
#endif

#if defined(__PIC24FJ64GA010__)
#include <p24FJ64GA010.h>
#endif

#if defined(__PIC24FJ64GA102__)
#include <p24FJ64GA102.h>
#endif

#if defined(__PIC24FJ64GA104__)
#include <p24FJ64GA104.h>
#endif

#if defined(__PIC24FJ64GA106__)
#include <p24FJ64GA106.h>
#endif

#if defined(__PIC24FJ64GA108__)
#include <p24FJ64GA108.h>
#endif

#if defined(__PIC24FJ64GA110__)
#include <p24FJ64GA110.h>
#endif

#if defined(__PIC24FJ64GA202__)
#include <p24FJ64GA202.h>
#endif

#if defined(__PIC24FJ64GA204__)
#include <p24FJ64GA204.h>
#endif

#if defined(__PIC24FJ64GA306__)
#include <p24FJ64GA306.h>
#endif

#if defined(__PIC24FJ64GA308__)
#include <p24FJ64GA308.h>
#endif

#if defined(__PIC24FJ64GA310__)
#include <p24FJ64GA310.h>
#endif

#if defined(__PIC24FJ64GA406__)
#include <p24FJ64GA406.h>
#endif

#if defined(__PIC24FJ64GA410__)
#include <p24FJ64GA410.h>
#endif

#if defined(__PIC24FJ64GA412__)
#include <p24FJ64GA412.h>
#endif

#if defined(__PIC24FJ64GA702__)
#include <p24FJ64GA702.h>
#endif

#if defined(__PIC24FJ64GA704__)
#include <p24FJ64GA704.h>
#endif

#if defined(__PIC24FJ64GA705__)
#include <p24FJ64GA705.h>
#endif

#if defined(__PIC24FJ64GB002__)
#include <p24FJ64GB002.h>
#endif

#if defined(__PIC24FJ64GB004__)
#include <p24FJ64GB004.h>
#endif

#if defined(__PIC24FJ64GB106__)
#include <p24FJ64GB106.h>
#endif

#if defined(__PIC24FJ64GB108__)
#include <p24FJ64GB108.h>
#endif

#if defined(__PIC24FJ64GB110__)
#include <p24FJ64GB110.h>
#endif

#if defined(__PIC24FJ64GB202__)
#include <p24FJ64GB202.h>
#endif

#if defined(__PIC24FJ64GB204__)
#include <p24FJ64GB204.h>
#endif

#if defined(__PIC24FJ64GB406__)
#include <p24FJ64GB406.h>
#endif

#if defined(__PIC24FJ64GB410__)
#include <p24FJ64GB410.h>
#endif

#if defined(__PIC24FJ64GB412__)
#include <p24FJ64GB412.h>
#endif

#if defined(__PIC24FJ64GC006__)
#include <p24FJ64GC006.h>
#endif

#if defined(__PIC24FJ64GC010__)
#include <p24FJ64GC010.h>
#endif

#if defined(__PIC24FJ64GL302__)
#include <p24FJ64GL302.h>
#endif

#if defined(__PIC24FJ64GL303__)
#include <p24FJ64GL303.h>
#endif

#if defined(__PIC24FJ64GL305__)
#include <p24FJ64GL305.h>
#endif

#if defined(__PIC24FJ64GL306__)
#include <p24FJ64GL306.h>
#endif

#if defined(__PIC24FJ64GP202__)
#include <p24FJ64GP202.h>
#endif

#if defined(__PIC24FJ64GP203__)
#include <p24FJ64GP203.h>
#endif

#if defined(__PIC24FJ64GP205__)
#include <p24FJ64GP205.h>
#endif

#if defined(__PIC24FJ64GU202__)
#include <p24FJ64GU202.h>
#endif

#if defined(__PIC24FJ64GU203__)
#include <p24FJ64GU203.h>
#endif

#if defined(__PIC24FJ64GU205__)
#include <p24FJ64GU205.h>
#endif

#if defined(__PIC24FJ96GA006__)
#include <p24FJ96GA006.h>
#endif

#if defined(__PIC24FJ96GA008__)
#include <p24FJ96GA008.h>
#endif

#if defined(__PIC24FJ96GA010__)
#include <p24FJ96GA010.h>
#endif

#if defined(__PIC24FV08KM101__)
#include <p24FV08KM101.h>
#endif

#if defined(__PIC24FV08KM102__)
#include <p24FV08KM102.h>
#endif

#if defined(__PIC24FV08KM202__)
#include <p24FV08KM202.h>
#endif

#if defined(__PIC24FV08KM204__)
#include <p24FV08KM204.h>
#endif

#if defined(__PIC24FV16KA301__)
#include <p24FV16KA301.h>
#endif

#if defined(__PIC24FV16KA302__)
#include <p24FV16KA302.h>
#endif

#if defined(__PIC24FV16KA304__)
#include <p24FV16KA304.h>
#endif

