dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
#if defined(__PIC24FV16KM102__)
#include <p24FV16KM102.h>
#endif

#if defined(__PIC24FV16KM104__)
#include <p24FV16KM104.h>
#endif

#if defined(__PIC24FV16KM202__)
#include <p24FV16KM202.h>
#endif

#if defined(__PIC24FV16KM204__)
#include <p24FV16KM204.h>
#endif

#if defined(__PIC24FV32KA301__)
#include <p24FV32KA301.h>
#endif

#if defined(__PIC24FV32KA302__)
#include <p24FV32KA302.h>
#endif

#if defined(__PIC24FV32KA304__)
#include <p24FV32KA304.h>
#endif

#if defined(__PIC24HJ128GP202__)
#include <p24HJ128GP202.h>
#endif

#if defined(__PIC24HJ128GP204__)
#include <p24HJ128GP204.h>
#endif

#if defined(__PIC24HJ128GP206__)
#include <p24HJ128GP206.h>
#endif

#if defined(__PIC24HJ128GP206A__)
#include <p24HJ128GP206A.h>
#endif

#if defined(__PIC24HJ128GP210__)
#include <p24HJ128GP210.h>
#endif

#if defined(__PIC24HJ128GP210A__)
#include <p24HJ128GP210A.h>
#endif

#if defined(__PIC24HJ128GP306__)
#include <p24HJ128GP306.h>
#endif

#if defined(__PIC24HJ128GP306A__)
#include <p24HJ128GP306A.h>
#endif

#if defined(__PIC24HJ128GP310__)
#include <p24HJ128GP310.h>
#endif

#if defined(__PIC24HJ128GP310A__)
#include <p24HJ128GP310A.h>
#endif

#if defined(__PIC24HJ128GP502__)
#include <p24HJ128GP502.h>
#endif

#if defined(__PIC24HJ128GP504__)
#include <p24HJ128GP504.h>
#endif

#if defined(__PIC24HJ128GP506__)
#include <p24HJ128GP506.h>
#endif

#if defined(__PIC24HJ128GP506A__)
#include <p24HJ128GP506A.h>
#endif

#if defined(__PIC24HJ128GP510__)
#include <p24HJ128GP510.h>
#endif

#if defined(__PIC24HJ128GP510A__)
#include <p24HJ128GP510A.h>
#endif

#if defined(__PIC24HJ12GP201__)
#include <p24HJ12GP201.h>
#endif

#if defined(__PIC24HJ12GP202__)
#include <p24HJ12GP202.h>
#endif

#if defined(__PIC24HJ16GP304__)
#include <p24HJ16GP304.h>
#endif

#if defined(__PIC24HJ256GP206__)
#include <p24HJ256GP206.h>
#endif

#if defined(__PIC24HJ256GP206A__)
#include <p24HJ256GP206A.h>
#endif

#if defined(__PIC24HJ256GP210__)
#include <p24HJ256GP210.h>
#endif

#if defined(__PIC24HJ256GP210A__)
#include <p24HJ256GP210A.h>
#endif

#if defined(__PIC24HJ256GP610__)
#include <p24HJ256GP610.h>
#endif

#if defined(__PIC24HJ256GP610A__)
#include <p24HJ256GP610A.h>
#endif

#if defined(__PIC24HJ32GP202__)
#include <p24HJ32GP202.h>
#endif

#if defined(__PIC24HJ32GP204__)
#include <p24HJ32GP204.h>
#endif

#if defined(__PIC24HJ32GP302__)
#include <p24HJ32GP302.h>
#endif

#if defined(__PIC24HJ32GP304__)
#include <p24HJ32GP304.h>
#endif

#if defined(__PIC24HJ64GP202__)
#include <p24HJ64GP202.h>
#endif

#if defined(__PIC24HJ64GP204__)
#include <p24HJ64GP204.h>
#endif

#if defined(__PIC24HJ64GP206__)
#include <p24HJ64GP206.h>
#endif

#if defined(__PIC24HJ64GP206A__)
#include <p24HJ64GP206A.h>
#endif

#if defined(__PIC24HJ64GP210__)
#include <p24HJ64GP210.h>
#endif

#if defined(__PIC24HJ64GP210A__)
#include <p24HJ64GP210A.h>
#endif

#if defined(__PIC24HJ64GP502__)
#include <p24HJ64GP502.h>
#endif

#if defined(__PIC24HJ64GP504__)
#include <p24HJ64GP504.h>
#endif

#if defined(__PIC24HJ64GP506__)
#include <p24HJ64GP506.h>
#endif

#if defined(__PIC24HJ64GP506A__)
#include <p24HJ64GP506A.h>
#endif

#if defined(__PIC24HJ64GP510__)
#include <p24HJ64GP510.h>
#endif

#if defined(__PIC24HJ64GP510A__)
#include <p24HJ64GP510A.h>
#endif

#if defined(__dsPIC30F1010__)
#include <p30F1010.h>
#endif

#if defined(__dsPIC30F2010__)
#include <p30F2010.h>
#endif

#if defined(__dsPIC30F2011__)
#include <p30F2011.h>
#endif

#if defined(__dsPIC30F2012__)
#include <p30F2012.h>
#endif

#if defined(__dsPIC30F2020__)
#include <p30F2020.h>
#endif

#if defined(__dsPIC30F2023__)
#include <p30F2023.h>
#endif

#if defined(__dsPIC30F3010__)
#include <p30F3010.h>
#endif

#if defined(__dsPIC30F3011__)
#include <p30F3011.h>
#endif

#if defined(__dsPIC30F3012__)
#include <p30F3012.h>
#endif

#if defined(__dsPIC30F3013__)
#include <p30F3013.h>
#endif

#if defined(__dsPIC30F3014__)
#include <p30F3014.h>
#endif

#if defined(__dsPIC30F4011__)
#include <p30F4011.h>
#endif

#if defined(__dsPIC30F4012__)
#include <p30F4012.h>
#endif

#if defined(__dsPIC30F4013__)
#include <p30F4013.h>
#endif

#if defined(__dsPIC30F5011__)
#include <p30F5011.h>
#endif

#if defined(__dsPIC30F5013__)
#include <p30F5013.h>
#endif

#if defined(__dsPIC30F5015__)
#include <p30F5015.h>
#endif

#if defined(__dsPIC30F5016__)
#include <p30F5016.h>
#endif

#if defined(__dsPIC30F6010__)
#include <p30F6010.h>
#endif

#if defined(__dsPIC30F6010A__)
#include <p30F6010A.h>
#endif

#if defined(__dsPIC30F6011__)
#include <p30F6011.h>
#endif

#if defined(__dsPIC30F6011A__)
#include <p30F6011A.h>
#endif

#if defined(__dsPIC30F6012__)
#include <p30F6012.h>
#endif

#if defined(__dsPIC30F6012A__)
#include <p30F6012A.h>
#endif

#if defined(__dsPIC30F6013__)
#include <p30F6013.h>
#endif

#if defined(__dsPIC30F6013A__)
#include <p30F6013A.h>
#endif

#if defined(__dsPIC30F6014__)
#include <p30F6014.h>
#endif

#if defined(__dsPIC30F6014A__)
#include <p30F6014A.h>
#endif

#if defined(__dsPIC30F6015__)
#include <p30F6015.h>
#endif

#if defined(__dsPIC33AH1024MPS618_33A_0__)
#include <p33AH1024MPS618_33A_0.h>
#endif

#if defined(__dsPIC33AH1024MPS618_33A_1__)
#include <p33AH1024MPS618_33A_1.h>
#endif

#if defined(__dsPIC33AK1024MPS614_FPGA__)
#include <p33AK1024MPS614_FPGA.h>
#endif

#if defined(__dsPIC33AK128MC102__)
#include <p33AK128MC102.h>
#endif

#if defined(__dsPIC33AK128MC103__)
#include <p33AK128MC103.h>
#endif

#if defined(__dsPIC33AK128MC105__)
#include <p33AK128MC105.h>
#endif

#if defined(__dsPIC33AK128MC106__)
#include <p33AK128MC106.h>
#endif

#if defined(__dsPIC33AK128MP206_FPGA__)
#include <p33AK128MP206_FPGA.h>
#endif

#if defined(__dsPIC33AK128MPS103__)
#include <p33AK128MPS103.h>
#endif

#if defined(__dsPIC33AK128MPS105__)
#include <p33AK128MPS105.h>
#endif

#if defined(__dsPIC33AK128MPS106__)
#include <p33AK128MPS106.h>
#endif

#if defined(__dsPIC33AK128MPS303__)
#include <p33AK128MPS303.h>
#endif

#if defined(__dsPIC33AK128MPS305__)
#include <p33AK128MPS305.h>
#endif

#if defined(__dsPIC33AK128MPS306__)
#include <p33AK128MPS306.h>
#endif

