dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
#if defined(__dsPIC33AK256MC205__)
#include <p33AK256MC205.h>
#endif

#if defined(__dsPIC33AK256MC206__)
#include <p33AK256MC206.h>
#endif

#if defined(__dsPIC33AK256MC208__)
#include <p33AK256MC208.h>
#endif

#if defined(__dsPIC33AK256MC210__)
#include <p33AK256MC210.h>
#endif

#if defined(__dsPIC33AK256MC505__)
#include <p33AK256MC505.h>
#endif

#if defined(__dsPIC33AK256MC506__)
#include <p33AK256MC506.h>
#endif

#if defined(__dsPIC33AK256MC508__)
#include <p33AK256MC508.h>
#endif

#if defined(__dsPIC33AK256MC510__)
#include <p33AK256MC510.h>
#endif

#if defined(__dsPIC33AK256MPS103__)
#include <p33AK256MPS103.h>
#endif

#if defined(__dsPIC33AK256MPS105__)
#include <p33AK256MPS105.h>
#endif

#if defined(__dsPIC33AK256MPS106__)
#include <p33AK256MPS106.h>
#endif

#if defined(__dsPIC33AK256MPS205__)
#include <p33AK256MPS205.h>
#endif

#if defined(__dsPIC33AK256MPS206__)
#include <p33AK256MPS206.h>
#endif

#if defined(__dsPIC33AK256MPS208__)
#include <p33AK256MPS208.h>
#endif

#if defined(__dsPIC33AK256MPS210__)
#include <p33AK256MPS210.h>
#endif

#if defined(__dsPIC33AK256MPS212__)
#include <p33AK256MPS212.h>
#endif

#if defined(__dsPIC33AK256MPS303__)
#include <p33AK256MPS303.h>
#endif

#if defined(__dsPIC33AK256MPS305__)
#include <p33AK256MPS305.h>
#endif

#if defined(__dsPIC33AK256MPS306__)
#include <p33AK256MPS306.h>
#endif

#if defined(__dsPIC33AK256MPS306_FPGA__)
#include <p33AK256MPS306_FPGA.h>
#endif

#if defined(__dsPIC33AK256MPS505__)
#include <p33AK256MPS505.h>
#endif

#if defined(__dsPIC33AK256MPS506__)
#include <p33AK256MPS506.h>
#endif

#if defined(__dsPIC33AK256MPS508__)
#include <p33AK256MPS508.h>
#endif

#if defined(__dsPIC33AK256MPS510__)
#include <p33AK256MPS510.h>
#endif

#if defined(__dsPIC33AK256MPS512__)
#include <p33AK256MPS512.h>
#endif

#if defined(__dsPIC33AK32MC102__)
#include <p33AK32MC102.h>
#endif

#if defined(__dsPIC33AK32MC103__)
#include <p33AK32MC103.h>
#endif

#if defined(__dsPIC33AK32MC105__)
#include <p33AK32MC105.h>
#endif

#if defined(__dsPIC33AK32MC106__)
#include <p33AK32MC106.h>
#endif

#if defined(__dsPIC33AK4096MPS817_FPGA__)
#include <p33AK4096MPS817_FPGA.h>
#endif

#if defined(__dsPIC33AK512MC205__)
#include <p33AK512MC205.h>
#endif

#if defined(__dsPIC33AK512MC206__)
#include <p33AK512MC206.h>
#endif

#if defined(__dsPIC33AK512MC208__)
#include <p33AK512MC208.h>
#endif

#if defined(__dsPIC33AK512MC210__)
#include <p33AK512MC210.h>
#endif

#if defined(__dsPIC33AK512MC505__)
#include <p33AK512MC505.h>
#endif

#if defined(__dsPIC33AK512MC506__)
#include <p33AK512MC506.h>
#endif

#if defined(__dsPIC33AK512MC508__)
#include <p33AK512MC508.h>
#endif

#if defined(__dsPIC33AK512MC510__)
#include <p33AK512MC510.h>
#endif

#if defined(__dsPIC33AK512MPS205__)
#include <p33AK512MPS205.h>
#endif

#if defined(__dsPIC33AK512MPS206__)
#include <p33AK512MPS206.h>
#endif

#if defined(__dsPIC33AK512MPS208__)
#include <p33AK512MPS208.h>
#endif

#if defined(__dsPIC33AK512MPS210__)
#include <p33AK512MPS210.h>
#endif

#if defined(__dsPIC33AK512MPS212__)
#include <p33AK512MPS212.h>
#endif

#if defined(__dsPIC33AK512MPS505__)
#include <p33AK512MPS505.h>
#endif

#if defined(__dsPIC33AK512MPS506__)
#include <p33AK512MPS506.h>
#endif

#if defined(__dsPIC33AK512MPS508__)
#include <p33AK512MPS508.h>
#endif

#if defined(__dsPIC33AK512MPS510__)
#include <p33AK512MPS510.h>
#endif

#if defined(__dsPIC33AK512MPS512__)
#include <p33AK512MPS512.h>
#endif

#if defined(__dsPIC33AK512MPS512_FPGA__)
#include <p33AK512MPS512_FPGA.h>
#endif

#if defined(__dsPIC33AK64MC102__)
#include <p33AK64MC102.h>
#endif

#if defined(__dsPIC33AK64MC103__)
#include <p33AK64MC103.h>
#endif

#if defined(__dsPIC33AK64MC105__)
#include <p33AK64MC105.h>
#endif

#if defined(__dsPIC33AK64MC106__)
#include <p33AK64MC106.h>
#endif

#if defined(__dsPIC33AKV256GMS205__)
#include <p33AKV256GMS205.h>
#endif

#if defined(__dsPIC33AKV256GMS206__)
#include <p33AKV256GMS206.h>
#endif

#if defined(__dsPIC33AKV256GMS208__)
#include <p33AKV256GMS208.h>
#endif

#if defined(__dsPIC33AKV256GMS210__)
#include <p33AKV256GMS210.h>
#endif

#if defined(__dsPIC33AKV256GMS505__)
#include <p33AKV256GMS505.h>
#endif

#if defined(__dsPIC33AKV256GMS506__)
#include <p33AKV256GMS506.h>
#endif

#if defined(__dsPIC33AKV256GMS508__)
#include <p33AKV256GMS508.h>
#endif

#if defined(__dsPIC33AKV256GMS510__)
#include <p33AKV256GMS510.h>
#endif

#if defined(__dsPIC33AKV512GMS205__)
#include <p33AKV512GMS205.h>
#endif

#if defined(__dsPIC33AKV512GMS206__)
#include <p33AKV512GMS206.h>
#endif

#if defined(__dsPIC33AKV512GMS208__)
#include <p33AKV512GMS208.h>
#endif

#if defined(__dsPIC33AKV512GMS210__)
#include <p33AKV512GMS210.h>
#endif

#if defined(__dsPIC33AKV512GMS505__)
#include <p33AKV512GMS505.h>
#endif

#if defined(__dsPIC33AKV512GMS506__)
#include <p33AKV512GMS506.h>
#endif

#if defined(__dsPIC33AKV512GMS508__)
#include <p33AKV512GMS508.h>
#endif

#if defined(__dsPIC33AKV512GMS510__)
#include <p33AKV512GMS510.h>
#endif

#if defined(__dsPIC33CDV128MC106__)
#include <p33CDV128MC106.h>
#endif

#if defined(__dsPIC33CDV128MC506__)
#include <p33CDV128MC506.h>
#endif

#if defined(__dsPIC33CDV128MP206__)
#include <p33CDV128MP206.h>
#endif

#if defined(__dsPIC33CDV128MP506__)
#include <p33CDV128MP506.h>
#endif

#if defined(__dsPIC33CDV256MC106__)
#include <p33CDV256MC106.h>
#endif

#if defined(__dsPIC33CDV256MC506__)
#include <p33CDV256MC506.h>
#endif

#if defined(__dsPIC33CDV256MP206__)
#include <p33CDV256MP206.h>
#endif

#if defined(__dsPIC33CDV256MP506__)
#include <p33CDV256MP506.h>
#endif

#if defined(__dsPIC33CDV64MC106__)
#include <p33CDV64MC106.h>
#endif

#if defined(__dsPIC33CDVC128MP506__)
#include <p33CDVC128MP506.h>
#endif

#if defined(__dsPIC33CDVC256MP506__)
#include <p33CDVC256MP506.h>
#endif

#if defined(__dsPIC33CDVL128MC106__)
#include <p33CDVL128MC106.h>
#endif

#if defined(__dsPIC33CDVL128MC506__)
#include <p33CDVL128MC506.h>
#endif

#if defined(__dsPIC33CDVL256MC106__)
#include <p33CDVL256MC106.h>
#endif

#if defined(__dsPIC33CDVL256MC506__)
#include <p33CDVL256MC506.h>
#endif

