dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
#if defined(__dsPIC33CDVL64MC106__)
#include <p33CDVL64MC106.h>
#endif

#if defined(__dsPIC33CH1024MP608__)
#include <p33CH1024MP608.h>
#endif

#if defined(__dsPIC33CH1024MP608S1__)
#include <p33CH1024MP608S1.h>
#endif

#if defined(__dsPIC33CH128MP202__)
#include <p33CH128MP202.h>
#endif

#if defined(__dsPIC33CH128MP202S1__)
#include <p33CH128MP202S1.h>
#endif

#if defined(__dsPIC33CH128MP203__)
#include <p33CH128MP203.h>
#endif

#if defined(__dsPIC33CH128MP203S1__)
#include <p33CH128MP203S1.h>
#endif

#if defined(__dsPIC33CH128MP205__)
#include <p33CH128MP205.h>
#endif

#if defined(__dsPIC33CH128MP205S1__)
#include <p33CH128MP205S1.h>
#endif

#if defined(__dsPIC33CH128MP206__)
#include <p33CH128MP206.h>
#endif

#if defined(__dsPIC33CH128MP206S1__)
#include <p33CH128MP206S1.h>
#endif

#if defined(__dsPIC33CH128MP208__)
#include <p33CH128MP208.h>
#endif

#if defined(__dsPIC33CH128MP208S1__)
#include <p33CH128MP208S1.h>
#endif

#if defined(__dsPIC33CH128MP502__)
#include <p33CH128MP502.h>
#endif

#if defined(__dsPIC33CH128MP502S1__)
#include <p33CH128MP502S1.h>
#endif

#if defined(__dsPIC33CH128MP503__)
#include <p33CH128MP503.h>
#endif

#if defined(__dsPIC33CH128MP503S1__)
#include <p33CH128MP503S1.h>
#endif

#if defined(__dsPIC33CH128MP505__)
#include <p33CH128MP505.h>
#endif

#if defined(__dsPIC33CH128MP505S1__)
#include <p33CH128MP505S1.h>
#endif

#if defined(__dsPIC33CH128MP506__)
#include <p33CH128MP506.h>
#endif

#if defined(__dsPIC33CH128MP506S1__)
#include <p33CH128MP506S1.h>
#endif

#if defined(__dsPIC33CH128MP508__)
#include <p33CH128MP508.h>
#endif

#if defined(__dsPIC33CH128MP508S1__)
#include <p33CH128MP508S1.h>
#endif

#if defined(__dsPIC33CH128RA502__)
#include <p33CH128RA502.h>
#endif

#if defined(__dsPIC33CH128RA502S1__)
#include <p33CH128RA502S1.h>
#endif

#if defined(__dsPIC33CH128RA503__)
#include <p33CH128RA503.h>
#endif

#if defined(__dsPIC33CH128RA503S1__)
#include <p33CH128RA503S1.h>
#endif

#if defined(__dsPIC33CH128RA505__)
#include <p33CH128RA505.h>
#endif

#if defined(__dsPIC33CH128RA505S1__)
#include <p33CH128RA505S1.h>
#endif

#if defined(__dsPIC33CH128RA506__)
#include <p33CH128RA506.h>
#endif

#if defined(__dsPIC33CH128RA506S1__)
#include <p33CH128RA506S1.h>
#endif

#if defined(__dsPIC33CH128RA508__)
#include <p33CH128RA508.h>
#endif

#if defined(__dsPIC33CH128RA508S1__)
#include <p33CH128RA508S1.h>
#endif

#if defined(__dsPIC33CH256MP205__)
#include <p33CH256MP205.h>
#endif

#if defined(__dsPIC33CH256MP205S1__)
#include <p33CH256MP205S1.h>
#endif

#if defined(__dsPIC33CH256MP206__)
#include <p33CH256MP206.h>
#endif

#if defined(__dsPIC33CH256MP206S1__)
#include <p33CH256MP206S1.h>
#endif

#if defined(__dsPIC33CH256MP208__)
#include <p33CH256MP208.h>
#endif

#if defined(__dsPIC33CH256MP208S1__)
#include <p33CH256MP208S1.h>
#endif

#if defined(__dsPIC33CH256MP218__)
#include <p33CH256MP218.h>
#endif

#if defined(__dsPIC33CH256MP218S1__)
#include <p33CH256MP218S1.h>
#endif

#if defined(__dsPIC33CH256MP505__)
#include <p33CH256MP505.h>
#endif

#if defined(__dsPIC33CH256MP505S1__)
#include <p33CH256MP505S1.h>
#endif

#if defined(__dsPIC33CH256MP506__)
#include <p33CH256MP506.h>
#endif

#if defined(__dsPIC33CH256MP506S1__)
#include <p33CH256MP506S1.h>
#endif

#if defined(__dsPIC33CH256MP508__)
#include <p33CH256MP508.h>
#endif

#if defined(__dsPIC33CH256MP508S1__)
#include <p33CH256MP508S1.h>
#endif

#if defined(__dsPIC33CH512MP205__)
#include <p33CH512MP205.h>
#endif

#if defined(__dsPIC33CH512MP205S1__)
#include <p33CH512MP205S1.h>
#endif

#if defined(__dsPIC33CH512MP206__)
#include <p33CH512MP206.h>
#endif

#if defined(__dsPIC33CH512MP206S1__)
#include <p33CH512MP206S1.h>
#endif

#if defined(__dsPIC33CH512MP208__)
#include <p33CH512MP208.h>
#endif

#if defined(__dsPIC33CH512MP208S1__)
#include <p33CH512MP208S1.h>
#endif

#if defined(__dsPIC33CH512MP505__)
#include <p33CH512MP505.h>
#endif

#if defined(__dsPIC33CH512MP505S1__)
#include <p33CH512MP505S1.h>
#endif

#if defined(__dsPIC33CH512MP506__)
#include <p33CH512MP506.h>
#endif

#if defined(__dsPIC33CH512MP506S1__)
#include <p33CH512MP506S1.h>
#endif

#if defined(__dsPIC33CH512MP508__)
#include <p33CH512MP508.h>
#endif

#if defined(__dsPIC33CH512MP508S1__)
#include <p33CH512MP508S1.h>
#endif

#if defined(__dsPIC33CH64MP202__)
#include <p33CH64MP202.h>
#endif

#if defined(__dsPIC33CH64MP202S1__)
#include <p33CH64MP202S1.h>
#endif

#if defined(__dsPIC33CH64MP203__)
#include <p33CH64MP203.h>
#endif

#if defined(__dsPIC33CH64MP203S1__)
#include <p33CH64MP203S1.h>
#endif

#if defined(__dsPIC33CH64MP205__)
#include <p33CH64MP205.h>
#endif

#if defined(__dsPIC33CH64MP205S1__)
#include <p33CH64MP205S1.h>
#endif

#if defined(__dsPIC33CH64MP206__)
#include <p33CH64MP206.h>
#endif

#if defined(__dsPIC33CH64MP206S1__)
#include <p33CH64MP206S1.h>
#endif

#if defined(__dsPIC33CH64MP208__)
#include <p33CH64MP208.h>
#endif

#if defined(__dsPIC33CH64MP208S1__)
#include <p33CH64MP208S1.h>
#endif

#if defined(__dsPIC33CH64MP502__)
#include <p33CH64MP502.h>
#endif

#if defined(__dsPIC33CH64MP502S1__)
#include <p33CH64MP502S1.h>
#endif

#if defined(__dsPIC33CH64MP503__)
#include <p33CH64MP503.h>
#endif

#if defined(__dsPIC33CH64MP503S1__)
#include <p33CH64MP503S1.h>
#endif

#if defined(__dsPIC33CH64MP505__)
#include <p33CH64MP505.h>
#endif

#if defined(__dsPIC33CH64MP505S1__)
#include <p33CH64MP505S1.h>
#endif

#if defined(__dsPIC33CH64MP506__)
#include <p33CH64MP506.h>
#endif

#if defined(__dsPIC33CH64MP506S1__)
#include <p33CH64MP506S1.h>
#endif

#if defined(__dsPIC33CH64MP508__)
#include <p33CH64MP508.h>
#endif

#if defined(__dsPIC33CH64MP508S1__)
#include <p33CH64MP508S1.h>
#endif

#if defined(__dsPIC33CK1024MP405__)
#include <p33CK1024MP405.h>
#endif

#if defined(__dsPIC33CK1024MP406__)
#include <p33CK1024MP406.h>
#endif

#if defined(__dsPIC33CK1024MP408__)
#include <p33CK1024MP408.h>
#endif

#if defined(__dsPIC33CK1024MP410__)
#include <p33CK1024MP410.h>
#endif

#if defined(__dsPIC33CK1024MP705__)
#include <p33CK1024MP705.h>
#endif

#if defined(__dsPIC33CK1024MP706__)
#include <p33CK1024MP706.h>
#endif

#if defined(__dsPIC33CK1024MP708__)
#include <p33CK1024MP708.h>
#endif

#if defined(__dsPIC33CK1024MP710__)
#include <p33CK1024MP710.h>
#endif

#if defined(__dsPIC33CK128MC002__)
#include <p33CK128MC002.h>
#endif

#if defined(__dsPIC33CK128MC003__)
#include <p33CK128MC003.h>
#endif

#if defined(__dsPIC33CK128MC005__)
#include <p33CK128MC005.h>
#endif

