dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
#if defined(__dsPIC33CK128MC006__)
#include <p33CK128MC006.h>
#endif

#if defined(__dsPIC33CK128MC102__)
#include <p33CK128MC102.h>
#endif

#if defined(__dsPIC33CK128MC103__)
#include <p33CK128MC103.h>
#endif

#if defined(__dsPIC33CK128MC105__)
#include <p33CK128MC105.h>
#endif

#if defined(__dsPIC33CK128MC106__)
#include <p33CK128MC106.h>
#endif

#if defined(__dsPIC33CK128MC502__)
#include <p33CK128MC502.h>
#endif

#if defined(__dsPIC33CK128MC503__)
#include <p33CK128MC503.h>
#endif

#if defined(__dsPIC33CK128MC505__)
#include <p33CK128MC505.h>
#endif

#if defined(__dsPIC33CK128MC506__)
#include <p33CK128MC506.h>
#endif

#if defined(__dsPIC33CK128MP202__)
#include <p33CK128MP202.h>
#endif

#if defined(__dsPIC33CK128MP203__)
#include <p33CK128MP203.h>
#endif

#if defined(__dsPIC33CK128MP205__)
#include <p33CK128MP205.h>
#endif

#if defined(__dsPIC33CK128MP206__)
#include <p33CK128MP206.h>
#endif

#if defined(__dsPIC33CK128MP208__)
#include <p33CK128MP208.h>
#endif

#if defined(__dsPIC33CK128MP502__)
#include <p33CK128MP502.h>
#endif

#if defined(__dsPIC33CK128MP503__)
#include <p33CK128MP503.h>
#endif

#if defined(__dsPIC33CK128MP505__)
#include <p33CK128MP505.h>
#endif

#if defined(__dsPIC33CK128MP506__)
#include <p33CK128MP506.h>
#endif

#if defined(__dsPIC33CK128MP508__)
#include <p33CK128MP508.h>
#endif

#if defined(__dsPIC33CK256MC002__)
#include <p33CK256MC002.h>
#endif

#if defined(__dsPIC33CK256MC003__)
#include <p33CK256MC003.h>
#endif

#if defined(__dsPIC33CK256MC005__)
#include <p33CK256MC005.h>
#endif

#if defined(__dsPIC33CK256MC006__)
#include <p33CK256MC006.h>
#endif

#if defined(__dsPIC33CK256MC102__)
#include <p33CK256MC102.h>
#endif

#if defined(__dsPIC33CK256MC103__)
#include <p33CK256MC103.h>
#endif

#if defined(__dsPIC33CK256MC105__)
#include <p33CK256MC105.h>
#endif

#if defined(__dsPIC33CK256MC106__)
#include <p33CK256MC106.h>
#endif

#if defined(__dsPIC33CK256MC502__)
#include <p33CK256MC502.h>
#endif

#if defined(__dsPIC33CK256MC503__)
#include <p33CK256MC503.h>
#endif

#if defined(__dsPIC33CK256MC505__)
#include <p33CK256MC505.h>
#endif

#if defined(__dsPIC33CK256MC506__)
#include <p33CK256MC506.h>
#endif

#if defined(__dsPIC33CK256MP202__)
#include <p33CK256MP202.h>
#endif

#if defined(__dsPIC33CK256MP203__)
#include <p33CK256MP203.h>
#endif

#if defined(__dsPIC33CK256MP205__)
#include <p33CK256MP205.h>
#endif

#if defined(__dsPIC33CK256MP206__)
#include <p33CK256MP206.h>
#endif

#if defined(__dsPIC33CK256MP208__)
#include <p33CK256MP208.h>
#endif

#if defined(__dsPIC33CK256MP305__)
#include <p33CK256MP305.h>
#endif

#if defined(__dsPIC33CK256MP306__)
#include <p33CK256MP306.h>
#endif

#if defined(__dsPIC33CK256MP308__)
#include <p33CK256MP308.h>
#endif

#if defined(__dsPIC33CK256MP405__)
#include <p33CK256MP405.h>
#endif

#if defined(__dsPIC33CK256MP406__)
#include <p33CK256MP406.h>
#endif

#if defined(__dsPIC33CK256MP408__)
#include <p33CK256MP408.h>
#endif

#if defined(__dsPIC33CK256MP410__)
#include <p33CK256MP410.h>
#endif

#if defined(__dsPIC33CK256MP502__)
#include <p33CK256MP502.h>
#endif

#if defined(__dsPIC33CK256MP503__)
#include <p33CK256MP503.h>
#endif

#if defined(__dsPIC33CK256MP505__)
#include <p33CK256MP505.h>
#endif

#if defined(__dsPIC33CK256MP506__)
#include <p33CK256MP506.h>
#endif

#if defined(__dsPIC33CK256MP508__)
#include <p33CK256MP508.h>
#endif

#if defined(__dsPIC33CK256MP605__)
#include <p33CK256MP605.h>
#endif

#if defined(__dsPIC33CK256MP606__)
#include <p33CK256MP606.h>
#endif

#if defined(__dsPIC33CK256MP608__)
#include <p33CK256MP608.h>
#endif

#if defined(__dsPIC33CK256MP705__)
#include <p33CK256MP705.h>
#endif

#if defined(__dsPIC33CK256MP706__)
#include <p33CK256MP706.h>
#endif

#if defined(__dsPIC33CK256MP708__)
#include <p33CK256MP708.h>
#endif

#if defined(__dsPIC33CK256MP710__)
#include <p33CK256MP710.h>
#endif

#if defined(__dsPIC33CK256MPT608__)
#include <p33CK256MPT608.h>
#endif

#if defined(__dsPIC33CK32MC002__)
#include <p33CK32MC002.h>
#endif

#if defined(__dsPIC33CK32MC003__)
#include <p33CK32MC003.h>
#endif

#if defined(__dsPIC33CK32MC005__)
#include <p33CK32MC005.h>
#endif

#if defined(__dsPIC33CK32MC102__)
#include <p33CK32MC102.h>
#endif

#if defined(__dsPIC33CK32MC103__)
#include <p33CK32MC103.h>
#endif

#if defined(__dsPIC33CK32MC105__)
#include <p33CK32MC105.h>
#endif

#if defined(__dsPIC33CK32MP102__)
#include <p33CK32MP102.h>
#endif

#if defined(__dsPIC33CK32MP103__)
#include <p33CK32MP103.h>
#endif

#if defined(__dsPIC33CK32MP105__)
#include <p33CK32MP105.h>
#endif

#if defined(__dsPIC33CK32MP202__)
#include <p33CK32MP202.h>
#endif

#if defined(__dsPIC33CK32MP203__)
#include <p33CK32MP203.h>
#endif

#if defined(__dsPIC33CK32MP205__)
#include <p33CK32MP205.h>
#endif

#if defined(__dsPIC33CK32MP206__)
#include <p33CK32MP206.h>
#endif

#if defined(__dsPIC33CK32MP502__)
#include <p33CK32MP502.h>
#endif

#if defined(__dsPIC33CK32MP503__)
#include <p33CK32MP503.h>
#endif

#if defined(__dsPIC33CK32MP505__)
#include <p33CK32MP505.h>
#endif

#if defined(__dsPIC33CK32MP506__)
#include <p33CK32MP506.h>
#endif

#if defined(__dsPIC33CK512MP305__)
#include <p33CK512MP305.h>
#endif

#if defined(__dsPIC33CK512MP306__)
#include <p33CK512MP306.h>
#endif

#if defined(__dsPIC33CK512MP308__)
#include <p33CK512MP308.h>
#endif

#if defined(__dsPIC33CK512MP405__)
#include <p33CK512MP405.h>
#endif

#if defined(__dsPIC33CK512MP406__)
#include <p33CK512MP406.h>
#endif

#if defined(__dsPIC33CK512MP408__)
#include <p33CK512MP408.h>
#endif

#if defined(__dsPIC33CK512MP410__)
#include <p33CK512MP410.h>
#endif

#if defined(__dsPIC33CK512MP605__)
#include <p33CK512MP605.h>
#endif

#if defined(__dsPIC33CK512MP606__)
#include <p33CK512MP606.h>
#endif

#if defined(__dsPIC33CK512MP608__)
#include <p33CK512MP608.h>
#endif

#if defined(__dsPIC33CK512MP705__)
#include <p33CK512MP705.h>
#endif

#if defined(__dsPIC33CK512MP706__)
#include <p33CK512MP706.h>
#endif

#if defined(__dsPIC33CK512MP708__)
#include <p33CK512MP708.h>
#endif

#if defined(__dsPIC33CK512MP710__)
#include <p33CK512MP710.h>
#endif

