dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
#if defined(__dsPIC33CK512MPT608__)
#include <p33CK512MPT608.h>
#endif

#if defined(__dsPIC33CK64MC002__)
#include <p33CK64MC002.h>
#endif

#if defined(__dsPIC33CK64MC003__)
#include <p33CK64MC003.h>
#endif

#if defined(__dsPIC33CK64MC005__)
#include <p33CK64MC005.h>
#endif

#if defined(__dsPIC33CK64MC102__)
#include <p33CK64MC102.h>
#endif

#if defined(__dsPIC33CK64MC103__)
#include <p33CK64MC103.h>
#endif

#if defined(__dsPIC33CK64MC105__)
#include <p33CK64MC105.h>
#endif

#if defined(__dsPIC33CK64MP102__)
#include <p33CK64MP102.h>
#endif

#if defined(__dsPIC33CK64MP103__)
#include <p33CK64MP103.h>
#endif

#if defined(__dsPIC33CK64MP105__)
#include <p33CK64MP105.h>
#endif

#if defined(__dsPIC33CK64MP202__)
#include <p33CK64MP202.h>
#endif

#if defined(__dsPIC33CK64MP203__)
#include <p33CK64MP203.h>
#endif

#if defined(__dsPIC33CK64MP205__)
#include <p33CK64MP205.h>
#endif

#if defined(__dsPIC33CK64MP206__)
#include <p33CK64MP206.h>
#endif

#if defined(__dsPIC33CK64MP208__)
#include <p33CK64MP208.h>
#endif

#if defined(__dsPIC33CK64MP502__)
#include <p33CK64MP502.h>
#endif

#if defined(__dsPIC33CK64MP503__)
#include <p33CK64MP503.h>
#endif

#if defined(__dsPIC33CK64MP505__)
#include <p33CK64MP505.h>
#endif

#if defined(__dsPIC33CK64MP506__)
#include <p33CK64MP506.h>
#endif

#if defined(__dsPIC33CK64MP508__)
#include <p33CK64MP508.h>
#endif

#if defined(__dsPIC33EDV64MC205__)
#include <p33EDV64MC205.h>
#endif

#if defined(__dsPIC33EP128GM304__)
#include <p33EP128GM304.h>
#endif

#if defined(__dsPIC33EP128GM306__)
#include <p33EP128GM306.h>
#endif

#if defined(__dsPIC33EP128GM310__)
#include <p33EP128GM310.h>
#endif

#if defined(__dsPIC33EP128GM604__)
#include <p33EP128GM604.h>
#endif

#if defined(__dsPIC33EP128GM706__)
#include <p33EP128GM706.h>
#endif

#if defined(__dsPIC33EP128GM710__)
#include <p33EP128GM710.h>
#endif

#if defined(__dsPIC33EP128GP502__)
#include <p33EP128GP502.h>
#endif

#if defined(__dsPIC33EP128GP504__)
#include <p33EP128GP504.h>
#endif

#if defined(__dsPIC33EP128GP506__)
#include <p33EP128GP506.h>
#endif

#if defined(__dsPIC33EP128GS702__)
#include <p33EP128GS702.h>
#endif

#if defined(__dsPIC33EP128GS704__)
#include <p33EP128GS704.h>
#endif

#if defined(__dsPIC33EP128GS705__)
#include <p33EP128GS705.h>
#endif

#if defined(__dsPIC33EP128GS706__)
#include <p33EP128GS706.h>
#endif

#if defined(__dsPIC33EP128GS708__)
#include <p33EP128GS708.h>
#endif

#if defined(__dsPIC33EP128GS804__)
#include <p33EP128GS804.h>
#endif

#if defined(__dsPIC33EP128GS805__)
#include <p33EP128GS805.h>
#endif

#if defined(__dsPIC33EP128GS806__)
#include <p33EP128GS806.h>
#endif

#if defined(__dsPIC33EP128GS808__)
#include <p33EP128GS808.h>
#endif

#if defined(__dsPIC33EP128MC202__)
#include <p33EP128MC202.h>
#endif

#if defined(__dsPIC33EP128MC204__)
#include <p33EP128MC204.h>
#endif

#if defined(__dsPIC33EP128MC206__)
#include <p33EP128MC206.h>
#endif

#if defined(__dsPIC33EP128MC502__)
#include <p33EP128MC502.h>
#endif

#if defined(__dsPIC33EP128MC504__)
#include <p33EP128MC504.h>
#endif

#if defined(__dsPIC33EP128MC506__)
#include <p33EP128MC506.h>
#endif

#if defined(__dsPIC33EP16GS202__)
#include <p33EP16GS202.h>
#endif

#if defined(__dsPIC33EP16GS502__)
#include <p33EP16GS502.h>
#endif

#if defined(__dsPIC33EP16GS504__)
#include <p33EP16GS504.h>
#endif

#if defined(__dsPIC33EP16GS505__)
#include <p33EP16GS505.h>
#endif

#if defined(__dsPIC33EP16GS506__)
#include <p33EP16GS506.h>
#endif

#if defined(__dsPIC33EP256GM304__)
#include <p33EP256GM304.h>
#endif

#if defined(__dsPIC33EP256GM306__)
#include <p33EP256GM306.h>
#endif

#if defined(__dsPIC33EP256GM310__)
#include <p33EP256GM310.h>
#endif

#if defined(__dsPIC33EP256GM604__)
#include <p33EP256GM604.h>
#endif

#if defined(__dsPIC33EP256GM706__)
#include <p33EP256GM706.h>
#endif

#if defined(__dsPIC33EP256GM710__)
#include <p33EP256GM710.h>
#endif

#if defined(__dsPIC33EP256GP502__)
#include <p33EP256GP502.h>
#endif

#if defined(__dsPIC33EP256GP504__)
#include <p33EP256GP504.h>
#endif

#if defined(__dsPIC33EP256GP506__)
#include <p33EP256GP506.h>
#endif

#if defined(__dsPIC33EP256MC202__)
#include <p33EP256MC202.h>
#endif

#if defined(__dsPIC33EP256MC204__)
#include <p33EP256MC204.h>
#endif

#if defined(__dsPIC33EP256MC206__)
#include <p33EP256MC206.h>
#endif

#if defined(__dsPIC33EP256MC502__)
#include <p33EP256MC502.h>
#endif

#if defined(__dsPIC33EP256MC504__)
#include <p33EP256MC504.h>
#endif

#if defined(__dsPIC33EP256MC506__)
#include <p33EP256MC506.h>
#endif

#if defined(__dsPIC33EP256MU806__)
#include <p33EP256MU806.h>
#endif

#if defined(__dsPIC33EP256MU810__)
#include <p33EP256MU810.h>
#endif

#if defined(__dsPIC33EP256MU814__)
#include <p33EP256MU814.h>
#endif

#if defined(__dsPIC33EP32GP502__)
#include <p33EP32GP502.h>
#endif

#if defined(__dsPIC33EP32GP503__)
#include <p33EP32GP503.h>
#endif

#if defined(__dsPIC33EP32GP504__)
#include <p33EP32GP504.h>
#endif

#if defined(__dsPIC33EP32GS202__)
#include <p33EP32GS202.h>
#endif

#if defined(__dsPIC33EP32GS502__)
#include <p33EP32GS502.h>
#endif

#if defined(__dsPIC33EP32GS504__)
#include <p33EP32GS504.h>
#endif

#if defined(__dsPIC33EP32GS505__)
#include <p33EP32GS505.h>
#endif

#if defined(__dsPIC33EP32GS506__)
#include <p33EP32GS506.h>
#endif

#if defined(__dsPIC33EP32MC202__)
#include <p33EP32MC202.h>
#endif

#if defined(__dsPIC33EP32MC203__)
#include <p33EP32MC203.h>
#endif

#if defined(__dsPIC33EP32MC204__)
#include <p33EP32MC204.h>
#endif

#if defined(__dsPIC33EP32MC502__)
#include <p33EP32MC502.h>
#endif

#if defined(__dsPIC33EP32MC503__)
#include <p33EP32MC503.h>
#endif

#if defined(__dsPIC33EP32MC504__)
#include <p33EP32MC504.h>
#endif

#if defined(__dsPIC33EP512GM304__)
#include <p33EP512GM304.h>
#endif

#if defined(__dsPIC33EP512GM306__)
#include <p33EP512GM306.h>
#endif

#if defined(__dsPIC33EP512GM310__)
#include <p33EP512GM310.h>
#endif

#if defined(__dsPIC33EP512GM604__)
#include <p33EP512GM604.h>
#endif

#if defined(__dsPIC33EP512GM706__)
#include <p33EP512GM706.h>
#endif

#if defined(__dsPIC33EP512GM710__)
#include <p33EP512GM710.h>
#endif

#if defined(__dsPIC33EP512GP502__)
#include <p33EP512GP502.h>
#endif

#if defined(__dsPIC33EP512GP504__)
#include <p33EP512GP504.h>
#endif

