dibo1968/pfc_1phases_dspic33ak/SimulinkProject/xc.h
#if defined(__dsPIC33EP512GP506__)
#include <p33EP512GP506.h>
#endif

#if defined(__dsPIC33EP512GP806__)
#include <p33EP512GP806.h>
#endif

#if defined(__dsPIC33EP512MC202__)
#include <p33EP512MC202.h>
#endif

#if defined(__dsPIC33EP512MC204__)
#include <p33EP512MC204.h>
#endif

#if defined(__dsPIC33EP512MC206__)
#include <p33EP512MC206.h>
#endif

#if defined(__dsPIC33EP512MC502__)
#include <p33EP512MC502.h>
#endif

#if defined(__dsPIC33EP512MC504__)
#include <p33EP512MC504.h>
#endif

#if defined(__dsPIC33EP512MC506__)
#include <p33EP512MC506.h>
#endif

#if defined(__dsPIC33EP512MC806__)
#include <p33EP512MC806.h>
#endif

#if defined(__dsPIC33EP512MU810__)
#include <p33EP512MU810.h>
#endif

#if defined(__dsPIC33EP512MU814__)
#include <p33EP512MU814.h>
#endif

#if defined(__dsPIC33EP64GP502__)
#include <p33EP64GP502.h>
#endif

#if defined(__dsPIC33EP64GP503__)
#include <p33EP64GP503.h>
#endif

#if defined(__dsPIC33EP64GP504__)
#include <p33EP64GP504.h>
#endif

#if defined(__dsPIC33EP64GP506__)
#include <p33EP64GP506.h>
#endif

#if defined(__dsPIC33EP64GS502__)
#include <p33EP64GS502.h>
#endif

#if defined(__dsPIC33EP64GS504__)
#include <p33EP64GS504.h>
#endif

#if defined(__dsPIC33EP64GS505__)
#include <p33EP64GS505.h>
#endif

#if defined(__dsPIC33EP64GS506__)
#include <p33EP64GS506.h>
#endif

#if defined(__dsPIC33EP64GS708__)
#include <p33EP64GS708.h>
#endif

#if defined(__dsPIC33EP64GS804__)
#include <p33EP64GS804.h>
#endif

#if defined(__dsPIC33EP64GS805__)
#include <p33EP64GS805.h>
#endif

#if defined(__dsPIC33EP64GS806__)
#include <p33EP64GS806.h>
#endif

#if defined(__dsPIC33EP64GS808__)
#include <p33EP64GS808.h>
#endif

#if defined(__dsPIC33EP64MC202__)
#include <p33EP64MC202.h>
#endif

#if defined(__dsPIC33EP64MC203__)
#include <p33EP64MC203.h>
#endif

#if defined(__dsPIC33EP64MC204__)
#include <p33EP64MC204.h>
#endif

#if defined(__dsPIC33EP64MC206__)
#include <p33EP64MC206.h>
#endif

#if defined(__dsPIC33EP64MC502__)
#include <p33EP64MC502.h>
#endif

#if defined(__dsPIC33EP64MC503__)
#include <p33EP64MC503.h>
#endif

#if defined(__dsPIC33EP64MC504__)
#include <p33EP64MC504.h>
#endif

#if defined(__dsPIC33EP64MC506__)
#include <p33EP64MC506.h>
#endif

#if defined(__dsPIC33EV128GM002__)
#include <p33EV128GM002.h>
#endif

#if defined(__dsPIC33EV128GM003__)
#include <p33EV128GM003.h>
#endif

#if defined(__dsPIC33EV128GM004__)
#include <p33EV128GM004.h>
#endif

#if defined(__dsPIC33EV128GM006__)
#include <p33EV128GM006.h>
#endif

#if defined(__dsPIC33EV128GM102__)
#include <p33EV128GM102.h>
#endif

#if defined(__dsPIC33EV128GM103__)
#include <p33EV128GM103.h>
#endif

#if defined(__dsPIC33EV128GM104__)
#include <p33EV128GM104.h>
#endif

#if defined(__dsPIC33EV128GM106__)
#include <p33EV128GM106.h>
#endif

#if defined(__dsPIC33EV256GM002__)
#include <p33EV256GM002.h>
#endif

#if defined(__dsPIC33EV256GM003__)
#include <p33EV256GM003.h>
#endif

#if defined(__dsPIC33EV256GM004__)
#include <p33EV256GM004.h>
#endif

#if defined(__dsPIC33EV256GM006__)
#include <p33EV256GM006.h>
#endif

#if defined(__dsPIC33EV256GM102__)
#include <p33EV256GM102.h>
#endif

#if defined(__dsPIC33EV256GM103__)
#include <p33EV256GM103.h>
#endif

#if defined(__dsPIC33EV256GM104__)
#include <p33EV256GM104.h>
#endif

#if defined(__dsPIC33EV256GM106__)
#include <p33EV256GM106.h>
#endif

#if defined(__dsPIC33EV32GM002__)
#include <p33EV32GM002.h>
#endif

#if defined(__dsPIC33EV32GM003__)
#include <p33EV32GM003.h>
#endif

#if defined(__dsPIC33EV32GM004__)
#include <p33EV32GM004.h>
#endif

#if defined(__dsPIC33EV32GM006__)
#include <p33EV32GM006.h>
#endif

#if defined(__dsPIC33EV32GM102__)
#include <p33EV32GM102.h>
#endif

#if defined(__dsPIC33EV32GM103__)
#include <p33EV32GM103.h>
#endif

#if defined(__dsPIC33EV32GM104__)
#include <p33EV32GM104.h>
#endif

#if defined(__dsPIC33EV32GM106__)
#include <p33EV32GM106.h>
#endif

#if defined(__dsPIC33EV64GM002__)
#include <p33EV64GM002.h>
#endif

#if defined(__dsPIC33EV64GM003__)
#include <p33EV64GM003.h>
#endif

#if defined(__dsPIC33EV64GM004__)
#include <p33EV64GM004.h>
#endif

#if defined(__dsPIC33EV64GM006__)
#include <p33EV64GM006.h>
#endif

#if defined(__dsPIC33EV64GM102__)
#include <p33EV64GM102.h>
#endif

#if defined(__dsPIC33EV64GM103__)
#include <p33EV64GM103.h>
#endif

#if defined(__dsPIC33EV64GM104__)
#include <p33EV64GM104.h>
#endif

#if defined(__dsPIC33EV64GM106__)
#include <p33EV64GM106.h>
#endif

#if defined(__dsPIC33FJ06GS001__)
#include <p33FJ06GS001.h>
#endif

#if defined(__dsPIC33FJ06GS101__)
#include <p33FJ06GS101.h>
#endif

#if defined(__dsPIC33FJ06GS101A__)
#include <p33FJ06GS101A.h>
#endif

#if defined(__dsPIC33FJ06GS102__)
#include <p33FJ06GS102.h>
#endif

#if defined(__dsPIC33FJ06GS102A__)
#include <p33FJ06GS102A.h>
#endif

#if defined(__dsPIC33FJ06GS202__)
#include <p33FJ06GS202.h>
#endif

#if defined(__dsPIC33FJ06GS202A__)
#include <p33FJ06GS202A.h>
#endif

#if defined(__dsPIC33FJ09GS302__)
#include <p33FJ09GS302.h>
#endif

#if defined(__dsPIC33FJ128GP202__)
#include <p33FJ128GP202.h>
#endif

#if defined(__dsPIC33FJ128GP204__)
#include <p33FJ128GP204.h>
#endif

#if defined(__dsPIC33FJ128GP206__)
#include <p33FJ128GP206.h>
#endif

#if defined(__dsPIC33FJ128GP206A__)
#include <p33FJ128GP206A.h>
#endif

#if defined(__dsPIC33FJ128GP306__)
#include <p33FJ128GP306.h>
#endif

#if defined(__dsPIC33FJ128GP306A__)
#include <p33FJ128GP306A.h>
#endif

#if defined(__dsPIC33FJ128GP310__)
#include <p33FJ128GP310.h>
#endif

#if defined(__dsPIC33FJ128GP310A__)
#include <p33FJ128GP310A.h>
#endif

#if defined(__dsPIC33FJ128GP706__)
#include <p33FJ128GP706.h>
#endif

#if defined(__dsPIC33FJ128GP706A__)
#include <p33FJ128GP706A.h>
#endif

#if defined(__dsPIC33FJ128GP708__)
#include <p33FJ128GP708.h>
#endif

#if defined(__dsPIC33FJ128GP708A__)
#include <p33FJ128GP708A.h>
#endif

#if defined(__dsPIC33FJ128GP710__)
#include <p33FJ128GP710.h>
#endif

#if defined(__dsPIC33FJ128GP710A__)
#include <p33FJ128GP710A.h>
#endif

#if defined(__dsPIC33FJ128GP802__)
#include <p33FJ128GP802.h>
#endif

#if defined(__dsPIC33FJ128GP804__)
#include <p33FJ128GP804.h>
#endif

